<a href="https://colab.research.google.com/github/bachi-mohamed-rafik/pandas/blob/main/US_Baby_Names.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#US Baby Names

In [2]:
import pandas as pd
baby_names=pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv",sep=',')
print(baby_names)

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

In [3]:
# See the first 10 entries
print("See the first 10 entries :")
print(baby_names.head(10))

See the first 10 entries :
   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

In [9]:
# Delete the column 'Unnamed: 0' and 'Id'
print("Delete the column 'Unnamed: 0' and 'Id' :")
# del baby_names['Unnamed: 0']
# del baby_names['Id']
baby_names = baby_names.loc[:, ~baby_names.columns.str.contains('^Unnamed')]
# Is there more male or female names in the dataset?
print("Is there more male or female names in the dataset :")
baby_names['Gender'].value_counts()
print(baby_names.sort_values("Count", ascending = 0).head())
# Group the dataset by name and assign to names
print("Group the dataset by name and assign to names :")
names=baby_names.groupby(baby_names['Name'])

Delete the column 'Unnamed: 0' and 'Id' :
Is there more male or female names in the dataset :
           Name  Year Gender State  Count
107416   Daniel  2004      M    CA   4167
110097   Daniel  2005      M    CA   3914
115739   Daniel  2007      M    CA   3865
112872   Daniel  2006      M    CA   3826
107417  Anthony  2004      M    CA   3805
Group the dataset by name and assign to names :
17632

In [10]:
# How many different names exist in the dataset?
print(len(names))
print("How many different names exist in the dataset :")
print (C.value_counts())

17632
How many different names exist in the dataset :
Riley      1112
Avery      1080
Jordan     1073
Peyton     1064
Hayden     1049
           ...
Jocilyn       1
Melea         1
Ishrat        1
Drayson       1
Azavion       1
Name: Name, Length: 17632, dtype: int64